<?php
$f = "c1.txt";  //ชื่อไฟล์สำหรับเก็บข้อมูล
$v = 0;
if(file_exists($f)) {   //ถ้ามีไฟล์อยู่แล้ว ให้ค่ามาใช้
	$v = file_get_contents($f);
}
else {
	$v = 0;  //กำหนดค่าเริ่มต้นที่ต้องการ
}

$v = intval($v) + 1;		//เพิ่มค่าจากเดิมไปอีก 1

//สัญลักษณ์ที่ใช้แทน HTML Decimal จาก 0-9
$html_decimal = array("&#9450;", "&#9312;", "&#9313;", "&#9314;", "&#9315;",
 								"&#9316;", "&#9317;", "&#9318;", "&#9319;", "&#9320;");
$visitor = number_format($v);
$len = strlen($visitor);
$counter = "";
for($i = 0; $i < $len; $i++) {
	$n = $visitor[$i];  //จากหลักการที่ว่าสตริงคืออาร์เรย์ของอักขระ เราก็อ่านอักขระลำดับที่ $i
	if($n != ",") {  //หลังจากใช้ number_format() อาจมี "," คั่นหลักพัน
		$counter .= $html_decimal[$n];
	}
	else {
		$counter .= ",";
	}
}
echo "<div id=\"visitor\"><i class=\"fa fa-group\"></i>ท่านเป็นผู้เยี่ยมชมลำดับที่ : <span>$counter</span></div>";

//อัปเดตตัวนับเดิม โดยเขียนทับจำนวนเดิม (ถ้าไม่มีไฟล์อยู่ก่อน ไฟล์จะถูกสร้างให้เอง)
file_put_contents($f, $v);
?>
